wrk2/misc_logs/compose_20.log
Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  2 threads and 10 connections
  Thread calibration: mean lat.: 14.057ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 14.127ms, rate sampling interval: 38ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.55ms    3.95ms  27.93ms   81.04%
    Req/Sec    10.24     15.96    54.00     94.06%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.57ms
 75.000%   15.04ms
 90.000%   18.24ms
 99.000%   27.93ms
 99.900%   37.02ms
 99.990%   39.78ms
 99.999%   39.78ms
100.000%   39.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.611     0.000000            1         1.00
       9.911     0.100000          102         1.11
      10.615     0.200000          206         1.25
      11.351     0.300000          306         1.43
      11.951     0.400000          408         1.67
      12.575     0.500000          510         2.00
      12.991     0.550000          561         2.22
      13.367     0.600000          611         2.50
      13.807     0.650000          662         2.86
      14.343     0.700000          713         3.33
      15.039     0.750000          765         4.00
      15.287     0.775000          789         4.44
      15.671     0.800000          815         5.00
      16.191     0.825000          840         5.71
      16.831     0.850000          869         6.67
      17.279     0.875000          891         8.00
      17.807     0.887500          904         8.89
      18.351     0.900000          917        10.00
      18.703     0.912500          929        11.43
      19.295     0.925000          942        13.33
      20.191     0.937500          955        16.00
      20.415     0.943750          961        17.78
      21.007     0.950000          968        20.00
      21.871     0.956250          974        22.86
      22.383     0.962500          980        26.67
      23.423     0.968750          987        32.00
      23.775     0.971875          990        35.56
      23.935     0.975000          994        40.00
      24.047     0.978125          996        45.71
      24.735     0.981250          999        53.33
      26.719     0.984375         1003        64.00
      26.799     0.985938         1004        71.11
      27.183     0.987500         1006        80.00
      27.839     0.989062         1007        91.43
      29.103     0.990625         1009       106.67
      30.079     0.992188         1011       128.00
      30.079     0.992969         1011       142.22
      30.319     0.993750         1012       160.00
      33.503     0.994531         1013       182.86
      34.687     0.995313         1014       213.33
      34.783     0.996094         1015       256.00
      34.783     0.996484         1015       284.44
      34.783     0.996875         1015       320.00
      36.159     0.997266         1016       365.71
      36.159     0.997656         1016       426.67
      37.023     0.998047         1017       512.00
      37.023     0.998242         1017       568.89
      37.023     0.998437         1017       640.00
      37.023     0.998633         1017       731.43
      37.023     0.998828         1017       853.33
      39.775     0.999023         1018      1024.00
      39.775     1.000000         1018          inf
#[Mean    =       13.548, StdDeviation   =        3.953]
#[Max     =       39.744, Total count    =         1018]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1235 requests in 1.00m, 259.30KB read
  Socket errors: connect 0, read 0, write 0, timeout 5
Requests/sec:     20.58
Transfer/sec:      4.32KB