wrk2/misc_logs/compose_40.log
Running 5m test @ http://usec-var-7:8080/wrk2-api/post/compose
  4 threads and 8 connections
  Thread calibration: mean lat.: 3401.851ms, rate sampling interval: 13893ms
  Thread calibration: mean lat.: 3164.420ms, rate sampling interval: 12967ms
  Thread calibration: mean lat.: 3319.466ms, rate sampling interval: 12730ms
  Thread calibration: mean lat.: 3061.320ms, rate sampling interval: 12214ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.09ms    6.20ms  38.78ms   85.97%
    Req/Sec     9.47      0.98    12.00     95.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.26ms
 75.000%   18.11ms
 90.000%   23.50ms
 99.000%   38.78ms
 99.900%   63.90ms
 99.990%   88.70ms
 99.999%   92.86ms
100.000%   92.86ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.159     0.000000            1         1.00
      10.919     0.100000         1161         1.11
      11.679     0.200000         2300         1.25
      12.407     0.300000         3448         1.43
      13.223     0.400000         4598         1.67
      14.255     0.500000         5753         2.00
      14.823     0.550000         6324         2.22
      15.519     0.600000         6897         2.50
      16.191     0.650000         7472         2.86
      17.071     0.700000         8051         3.33
      18.111     0.750000         8621         4.00
      18.735     0.775000         8911         4.44
      19.407     0.800000         9200         5.00
      20.223     0.825000         9489         5.71
      21.119     0.850000         9770         6.67
      22.111     0.875000        10057         8.00
      22.751     0.887500        10201         8.89
      23.503     0.900000        10344        10.00
      24.431     0.912500        10488        11.43
      25.295     0.925000        10632        13.33
      26.239     0.937500        10775        16.00
      27.055     0.943750        10851        17.78
      27.983     0.950000        10920        20.00
      28.815     0.956250        10991        22.86
      29.855     0.962500        11063        26.67
      31.279     0.968750        11136        32.00
      31.999     0.971875        11170        35.56
      32.607     0.975000        11206        40.00
      33.503     0.978125        11242        45.71
      34.303     0.981250        11278        53.33
      35.551     0.984375        11314        64.00
      36.191     0.985938        11332        71.11
      36.991     0.987500        11350        80.00
      37.887     0.989062        11368        91.43
      39.359     0.990625        11387       106.67
      40.639     0.992188        11405       128.00
      41.183     0.992969        11413       142.22
      42.207     0.993750        11422       160.00
      42.847     0.994531        11431       182.86
      44.095     0.995313        11440       213.33
      45.823     0.996094        11450       256.00
      46.175     0.996484        11453       284.44
      47.199     0.996875        11458       320.00
      48.095     0.997266        11462       365.71
      48.959     0.997656        11467       426.67
      50.495     0.998047        11471       512.00
      54.335     0.998242        11473       568.89
      57.183     0.998437        11476       640.00
      61.119     0.998633        11478       731.43
      61.823     0.998828        11480       853.33
      63.903     0.999023        11482      1024.00
      68.287     0.999121        11483      1137.78
      68.863     0.999219        11485      1280.00
      69.695     0.999316        11486      1462.86
      71.423     0.999414        11487      1706.67
      72.127     0.999512        11488      2048.00
      72.127     0.999561        11488      2275.56
      75.711     0.999609        11489      2560.00
      76.415     0.999658        11490      2925.71
      76.415     0.999707        11490      3413.33
      86.207     0.999756        11491      4096.00
      86.207     0.999780        11491      4551.11
      86.207     0.999805        11491      5120.00
      88.703     0.999829        11492      5851.43
      88.703     0.999854        11492      6826.67
      88.703     0.999878        11492      8192.00
      88.703     0.999890        11492      9102.22
      88.703     0.999902        11492     10240.00
      92.863     0.999915        11493     11702.86
      92.863     1.000000        11493          inf
#[Mean    =       16.085, StdDeviation   =        6.197]
#[Max     =       92.800, Total count    =        11493]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11919 requests in 5.00m, 2.44MB read
Requests/sec:     39.73
Transfer/sec:      8.34KB