wrk2/misc_logs/home_120.log
Running 5m test @ http://usec-var-7:8080/wrk2-api/home-timeline/read
  4 threads and 8 connections
  Thread calibration: mean lat.: 21.313ms, rate sampling interval: 61ms
  Thread calibration: mean lat.: 21.476ms, rate sampling interval: 70ms
  Thread calibration: mean lat.: 85.197ms, rate sampling interval: 279ms
  Thread calibration: mean lat.: 20.349ms, rate sampling interval: 63ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    16.16ms    6.81ms  41.18ms   81.90%
    Req/Sec    29.62     20.71    85.00     74.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   14.22ms
 75.000%   18.53ms
 90.000%   24.72ms
 99.000%   41.18ms
 99.900%   58.24ms
 99.990%   73.79ms
 99.999%   82.69ms
100.000%   82.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.055     0.000000            1         1.00
      10.079     0.100000         3475         1.11
      11.167     0.200000         6927         1.25
      12.159     0.300000        10404         1.43
      13.143     0.400000        13846         1.67
      14.215     0.500000        17306         2.00
      14.855     0.550000        19039         2.22
      15.567     0.600000        20749         2.50
      16.399     0.650000        22484         2.86
      17.375     0.700000        24211         3.33
      18.527     0.750000        25949         4.00
      19.231     0.775000        26804         4.44
      20.015     0.800000        27669         5.00
      20.927     0.825000        28542         5.71
      21.935     0.850000        29405         6.67
      23.167     0.875000        30263         8.00
      23.887     0.887500        30697         8.89
      24.719     0.900000        31122        10.00
      25.759     0.912500        31559        11.43
      26.767     0.925000        31992        13.33
      28.015     0.937500        32426        16.00
      28.783     0.943750        32637        17.78
      29.711     0.950000        32854        20.00
      30.591     0.956250        33069        22.86
      31.663     0.962500        33286        26.67
      33.055     0.968750        33501        32.00
      33.951     0.971875        33610        35.56
      34.655     0.975000        33718        40.00
      35.615     0.978125        33824        45.71
      36.703     0.981250        33933        53.33
      38.047     0.984375        34040        64.00
      38.623     0.985938        34094        71.11
      39.487     0.987500        34149        80.00
      40.575     0.989062        34203        91.43
      41.791     0.990625        34257       106.67
      43.135     0.992188        34310       128.00
      44.031     0.992969        34338       142.22
      44.927     0.993750        34365       160.00
      45.951     0.994531        34391       182.86
      46.879     0.995313        34419       213.33
      47.999     0.996094        34445       256.00
      48.735     0.996484        34460       284.44
      49.279     0.996875        34472       320.00
      50.559     0.997266        34486       365.71
      51.551     0.997656        34500       426.67
      52.511     0.998047        34514       512.00
      53.663     0.998242        34520       568.89
      54.335     0.998437        34526       640.00
      55.263     0.998633        34533       731.43
      57.407     0.998828        34541       853.33
      58.591     0.999023        34547      1024.00
      59.295     0.999121        34550      1137.78
      61.055     0.999219        34553      1280.00
      62.367     0.999316        34557      1462.86
      63.871     0.999414        34560      1706.67
      66.303     0.999512        34564      2048.00
      66.687     0.999561        34565      2275.56
      66.943     0.999609        34567      2560.00
      67.583     0.999658        34569      2925.71
      67.775     0.999707        34570      3413.33
      69.759     0.999756        34572      4096.00
      70.847     0.999780        34573      4551.11
      71.295     0.999805        34574      5120.00
      72.255     0.999829        34575      5851.43
      72.255     0.999854        34575      6826.67
      73.087     0.999878        34576      8192.00
      73.791     0.999890        34577      9102.22
      73.791     0.999902        34577     10240.00
      74.239     0.999915        34578     11702.86
      74.239     0.999927        34578     13653.33
      74.239     0.999939        34578     16384.00
      78.399     0.999945        34579     18204.44
      78.399     0.999951        34579     20480.00
      78.399     0.999957        34579     23405.71
      78.399     0.999963        34579     27306.67
      78.399     0.999969        34579     32768.00
      82.687     0.999973        34580     36408.89
      82.687     1.000000        34580          inf
#[Mean    =       16.161, StdDeviation   =        6.811]
#[Max     =       82.624, Total count    =        34580]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  35817 requests in 5.00m, 497.13MB read
Requests/sec:    119.38
Transfer/sec:      1.66MB